{
  "why-me": {
    "title": "Wieso ich",
    "i-am": "Ich befinde",
    "located": "mich in Bonn",
    "coding": "Coding ist mehr als nur das Schreiben von Code – es geht darum, Probleme zu lösen und etwas aus dem Nichts zu erschaffen. Es fordert mich heraus, analytisch zu denken, dranzubleiben und Ideen in die Realität umzusetzen.",
    "button": "Lass uns reden"
  },
  "landing-page": {
    "title": "Frontend Entwickler"
  },
  "navbar": {
    "whyme": "Warum ich",
    "skills": "Fähigkeiten",
    "projects": "Projekte",
    "contact": "Kontakt"
  },
  "my-skills": {
    "title": "Meine Fähigkeiten",
    "learning": "Ich lerne derzeit ...",
    "text": "Ich bin motiviert, meine Fähigkeiten zu verbessern, innovative Lösungen zu erkunden und mit neuen Technologien auf dem neuesten Stand zu bleiben. Derzeit lerne ich React und Vue.js und wende mein Wissen in Projekten an."
  },
  "feedback": {
    "title": "Brauchen Sie einen Teamplayer? Hier ist, was meine Kollegen über mich gesagt haben:"
  },
  "contact": {
    "title": "Kontakt",
    "text": "Ich bin immer offen für spannende Jobangebote und neue Möglichkeiten, bei denen ich meine Fähigkeiten einbringen kann. Mit meiner Erfahrung und meiner Leidenschaft für durchdachte, benutzerfreundliche Anwendungen bringe ich echten Mehrwert in jedes Projekt. Lassen Sie uns gemeinsam etwas Großartiges schaffen!",
    "name": "Ihr Name",
    "email": "Ihre E-Mail",
    "message": "Ihre Nachricht",
    "read": "Ich habe die",
    "privacy": "Datenschutzerklärung",
    "agree": "gelesen und stimme der Verarbeitung meiner Daten wie beschrieben zu.",
    "button": "Senden"
  },
  "my-projects": {
  "title": "Meine Projekte",
  "duration": "Dauer: 3 Wochen",
  "about": "Über das Projekt",
  "organised": "So habe ich meinen Arbeitsprozess organisiert",
  "experience": "Meine Erfahrung in der Gruppenarbeit",
  "learn":"Was ich gelernt habe",
  "elPolloLoco-about": "Ein einfaches Jump-and-Run-Spiel basierend auf einem objektorientierten Ansatz. Hilf Sharkie, Münzen und Giftflaschen zu finden, um gegen den Endboss Chicken und die Small Chickens zu kämpfen.",
  "elPolloLoco-organised":"Um dieses Jump-and-Run-Spiel zu entwickeln, habe ich einen strukturierten und organisierten Workflow verfolgt. Ich habe einen objektorientierten Ansatz verwendet, um den Code sauber, modular und leicht wartbar zu halten. Jedes Spielelement, wie der Spieler, die Gegner und die sammelbaren Objekte, wurde als eigene Klasse implementiert, um Wiederverwendbarkeit zu gewährleisten. Zudem habe ich einen schrittweisen Entwicklungsprozess befolgt, beginnend mit den Kernmechaniken, gefolgt von Animationen, Kollisionserkennung und Spiel-Logik. Durch regelmäßiges Testen und Debuggen konnte ich das Gameplay optimieren und Fehler effizient beheben. Dieser strukturierte Ansatz sorgte für einen reibungslosen und gut organisierten Entwicklungsprozess.",
  "elPolloLoco-learn":"Während der Entwicklung dieses Spiels habe ich wertvolle Erfahrungen in objektorientierter Programmierung und Spieleentwicklung gesammelt. Ich habe gelernt, wie man sauberen und wartbaren Code strukturiert, Animationen implementiert und Kollisionserkennung effektiv umsetzt. Durch Debugging und Testing habe ich die Bedeutung der Feinabstimmung des Gameplays für ein reibungsloses Spielerlebnis erkannt. Insgesamt hat dieses Projekt meine Programmierfähigkeiten und mein Problemlösungsvermögen verbessert."
},
"privacy-policy": {
  "privacyPolicy": "Datenschutzerklärung",
  "privacyIntro": "Ihre Privatsphäre ist uns wichtig. Diese Datenschutzerklärung erklärt, wie wir Ihre persönlichen Daten sammeln, verwenden und schützen, wenn Sie unsere Website [Your Website] und andere von uns betriebene Plattformen besuchen.",
  "infoWeCollect": "Welche Informationen wir sammeln",
  "infoWeCollectDesc": "Wir sammeln personenbezogene Daten nur, wenn es notwendig ist, zum Beispiel:",
  "voluntaryData": "Wenn Sie freiwillig Daten bereitstellen",
  "automaticData": "Automatisch durch Website-Interaktionen",
  "externalSources": "Von externen Quellen, falls zutreffend",
  "howWeUseInfo": "Wie wir Ihre Daten verwenden",
  "howWeUseInfoDesc": "Wir verwenden die gesammelten Daten, um:",
  "operateWebsite": "Unsere Website zu betreiben und zu verbessern",
  "enhanceExperience": "Die Benutzererfahrung zu verbessern",
  "analyzeTraffic": "Den Website-Verkehr und die Leistung zu analysieren",
  "developFeatures": "Neue Funktionen und Dienstleistungen zu entwickeln",
  "communicateUpdates": "Updates und Support bereitzustellen",
  "processTransactions": "Transaktionen zu verarbeiten",
  "preventFraud": "Betrug zu verhindern",
  "sharingInfo": "Weitergabe Ihrer Informationen",
  "sharingInfoDesc": "Wir verkaufen oder teilen Ihre Daten nicht öffentlich. Wir geben Informationen nur weiter, wenn dies gesetzlich erforderlich ist.",
  "dataRetention": "Datenspeicherung",
  "dataRetentionDesc": "Ihre Daten werden nur so lange gespeichert, wie es zur Erfüllung gesetzlicher und betrieblicher Anforderungen erforderlich ist.",
  "dataRights": "Ihre Datenschutzrechte",
  "dataRightsDesc": "Abhängig von Ihrem Standort haben Sie möglicherweise das Recht auf:",
  "accessData": "Zugriff auf Ihre persönlichen Daten",
  "requestCorrection": "Berichtigung von Daten",
  "requestDeletion": "Löschung der Daten unter bestimmten Bedingungen",
  "restrictProcessing": "Einschränkung oder Widerspruch gegen die Datenverarbeitung",
  "requestTransfer": "Übertragung der Daten anzufordern",
  "policyUpdates": "Aktualisierungen dieser Richtlinie",
  "policyUpdatesDesc": "Wir können diese Datenschutzerklärung von Zeit zu Zeit aktualisieren. Änderungen treten in Kraft, sobald sie auf dieser Seite veröffentlicht werden.",
  "contactUs": "Kontaktieren Sie uns",
  "contactUsDesc": "Wenn Sie Fragen haben, können Sie uns gerne kontaktieren:",
  "goBack": "Zurück"
}
}